StasOverflow/stm32_flash/app/back/c_imports/stm32flash/stm_py.c
#include <Python.h>
#include "structmember.h"

#include <sys/types.h>
#include <sys/stat.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>

#include "init.h"
#include "utils.h"
#include "serial.h"
#include "stm32.h"
#include "parsers/parser.h"
#include "port.h"

#include "parsers/binary.h"
#include "parsers/hex.h"

static void close_with_argument( PyObject *self, int ret, int flag, unsigned long addr );

static PyObject* polled_method(PyObject * self, PyObject * args, PyObject * keywds);
static PyObject* pull_method(PyObject * self, PyObject * args, PyObject * keywds);


#define DEFAULT_GPIO_SEQ                "rts,dtr"

enum actions {
	ACT_NONE,
	ACT_READ,
	ACT_WRITE,
	ACT_WRITE_UNPROTECT,
	ACT_READ_PROTECT,
	ACT_READ_UNPROTECT,
	ACT_ERASE_ONLY,
	ACT_CRC
};

static const char *action2str(enum actions act);
//static void err_multi_action(enum actions new);
static int is_addr_in_ram(uint32_t addr);
static int is_addr_in_flash(uint32_t addr);
/* returns the page that contains address "addr" */
static int flash_addr_to_page_floor(uint32_t addr);
/* returns the first page whose start addr is >= "addr" */
int flash_addr_to_page_ceil(uint32_t addr);
/* returns the lower address of flash page "page" */
static uint32_t flash_page_to_addr(int page);

/***********************************************************************************************************************
 *
 *      Port-dependant structures and methods, settings structure is filled with values from start
 *
 **********************************************************************************************************************/
static struct port_options port_opts = {
	.device			    = "COM5",
	.baudRate		    = SERIAL_BAUD_57600,
	.serial_mode		= "8e1",
	.bus_addr		    = 0,
	.rx_frame_max		= STM32_MAX_RX_FRAME,
	.tx_frame_max		= STM32_MAX_TX_FRAME,
};
static struct port_interface   *port = NULL;
static PyObject* open_da_port(PyObject *self, PyObject *args, PyObject *keywds);
static PyObject* close_da_port(PyObject *self, PyObject *args);


static PyObject* open_da_port(PyObject *self, PyObject *args, PyObject *keywds)
{
    const char          *device         =   port_opts.device;
    long                baudrate        =   serial_get_baud_int(port_opts.baudRate);

    static char *kwlist[] = {"device", "baudrate", NULL};

    if (!PyArg_ParseTupleAndKeywords(args, keywds, "|sl", kwlist, &device, &baudrate))
    {
        return NULL;
    }

    PyObject *argsumentios =  Py_BuildValue("()");

    printf("dernem pythonom \n");

    PyObject *myobject_method = PyObject_GetAttrString(self, "port_close");

    PyObject *result = PyObject_Call(myobject_method, argsumentios, NULL);

    Py_XDECREF(argsumentios);
    Py_XDECREF(myobject_method);
    Py_XDECREF(result);

    port_opts.device = device;
    port_opts.baudRate = serial_get_baud(baudrate);


    printf("Portopts struct is now %s\n", port_opts.device);

    if (port_open(&port_opts, &port) != PORT_ERR_OK)
    {
		printf("Failed to open port: %s\n", port_opts.device);
		close_with_argument(self, 1, 0, 0);
		return Py_None;
	}
	else
	{
		printf("Successfully opened port %s\n", port_opts.device);
		printf("With baudrate %d\t\n", serial_get_baud_int(port_opts.baudRate));
		printf("With serial mode %s\t\n", port_opts.serial_mode);
		printf("With bus addres %d\t\n", port_opts.bus_addr);
		printf("with rx_max %d of %d\t\n", port_opts.rx_frame_max, STM32_MAX_RX_FRAME);
		printf("with tx_max %d of %d\t\n", port_opts.tx_frame_max, STM32_MAX_TX_FRAME);
	}

	if( port )
	{
	    printf("Interface %s: %s\n", port->name, port->get_cfg_str(port));
	}

    Py_XDECREF(args);

	return Py_None;
}


static PyObject* close_da_port(PyObject *self, PyObject *args)
{
	if (port)
	{
        printf("there were an instance of a port opened before, so close it \n");
		port->close(port);
		port = NULL;
		printf("Port closed \n");
	}
	else
	{
	    printf("Error closing port \n");
	}

    Py_XDECREF(args);

	return Py_None;
}
/***********************************************************************************************************************
 *
 *      Parser-dependant structures and methods
 *
 **********************************************************************************************************************/
static void		    *p_st		        = NULL;
static parser_t	    *parser		        = NULL;

static PyObject* init_da_parser(PyObject * self, PyObject *args, PyObject *keywds)
{
    char            *file_path;
    int             action;
    bool            force_binary = 0;
	parser_err_t    perr;

    static char *kwlist[] = {"file_path", "action", "force_binary", NULL};

    if (!PyArg_ParseTupleAndKeywords(args, keywds, "si|p", kwlist, &file_path, &action, &force_binary))
    {
        return NULL;
    }

    printf("So the arguments are: \n");
    printf("path to file: %s \n", file_path);
    printf("action: %s\n", action2str(action));
    printf("binary_forcing %d\n", force_binary);

	if (action == ACT_WRITE)
	{
		// first try hex
		if (!force_binary)
		{
			parser = &PARSER_HEX;
			p_st = parser->init();
			if (!p_st)
			{
				printf("%s Parser failed to initialize\n", parser->name);
                close_with_argument(self, 1, 0, 0);
                return Py_None;
			}
		}

		if (force_binary || (perr = parser->open(p_st, file_path, 0)) != PARSER_ERR_OK)
		{
			if (force_binary || perr == PARSER_ERR_INVALID_FILE)
			{
				if (!force_binary)
				{
					parser->close(p_st);
					p_st = NULL;
				}

				// now try binary
				parser = &PARSER_BINARY;
				p_st = parser->init();
				if (!p_st)
				{
					printf("%s Parser failed to initialize\n", parser->name);
                    close_with_argument(self, 1, 0, 0);
                    return Py_None;
				}
				perr = parser->open(p_st, file_path, 0);
			}

			// if still have an error, fail
			if (perr != PARSER_ERR_OK)
			{
				printf("%s ERROR: %s\n", parser->name, parser_errstr(perr));
				if (perr == PARSER_ERR_SYSTEM)
				{
				    perror(file_path);
				}

