StasOverflow/stm32_flash/app/back/c_imports/stm32flash/stm_py.c
                close_with_argument(self, 1, 0, 0);
                return Py_None;
			}
		}

		printf("Using Parser : %s\n", parser->name);
	} else {
		parser = &PARSER_BINARY;
		p_st = parser->init();
		if (!p_st)
		{
			printf("%s Parser failed to initialize\n", parser->name);

            close_with_argument(self, 1, 0, 0);
            return Py_None;
            // Insert Close goto close;
		}
	}

//    Py_XDECREF(kwlist);
//    Py_XDECREF(args);
//    Py_XDECREF(keywds);

    return Py_None;
}

static PyObject* open_with_parser(PyObject * self, PyObject *args, PyObject *keywds)
{
    char *file_path;

    static char *kwlist[] = {"file_path", NULL};

    if (!PyArg_ParseTupleAndKeywords(args, keywds, "s|", kwlist, &file_path))
    {
        return NULL;
    }

    printf("file is %s \n", file_path);

    Py_XDECREF(kwlist);
    Py_XDECREF(args);
//    Py_XDECREF(keywds);

    return Py_None;
}

static PyObject* close_da_parser(PyObject * self, PyObject * args)
{
	if (p_st)
	{
	    parser->close(p_st);
        p_st = NULL;
	}

    Py_XDECREF(args);

    return Py_None;
}
/***********************************************************************************************************************
 *
 *      STM-dependant structures and methods
 *
 **********************************************************************************************************************/
static stm32_t		    *stm        		    = NULL;

static PyObject* close_da_stm(PyObject * self, PyObject * args);
static PyObject* init_da_stm(PyObject * self, PyObject * args, PyObject * keywds);


static PyObject* init_da_stm(PyObject * self, PyObject * args, PyObject * keywds)
{
    bool init_flag = 1;
    char *gpio_seq = DEFAULT_GPIO_SEQ;

    static char *kwlist[] = {"init_flag", "gpio_seq", NULL};

    if (!PyArg_ParseTupleAndKeywords(args, keywds, "|ps", kwlist, &init_flag, &gpio_seq))
    {
        return NULL;
    }

    close_da_stm(self, NULL);

    if( port )
    {
        if (init_flag && init_bl_entry(port, gpio_seq) == 0)
        {
            printf("Something went wrong with init bl stuff \n");
            close_with_argument(self, 1, 0, 0);
            return Py_None;
        }
        stm = stm32_init(port, init_flag);
        if (!stm)
        {
            printf("stm somehow didn't manage to launch \n");
            close_with_argument(self, 1, 0, 0);
            return Py_None;
        }
        else
        {
            printf("allrighty with stmio \n");
        }
    }
    else
    {
        // raise some ERROR: Unitialized based crap
        printf("INIT DA PORT AT THE FIRST PLACE, PLEASE \n");
		close_with_argument(self, 1, 0, 0);
		return Py_None;
    }

    Py_XDECREF(kwlist);
    Py_XDECREF(args);
    Py_XDECREF(keywds);

	return Py_None;
}


static PyObject* close_da_stm(PyObject * self, PyObject * args)
{
	if( stm )
	{
	    printf("There were an instance of stm, closing \n");
	    stm32_close(stm);
	}

    Py_XDECREF(args);

	return Py_None;
}

/***********************************************************************************************************************
 *
 *      Perform an action, based on the argument passed
 *
 **********************************************************************************************************************/
static double percents = 0;

static PyObject *percents_set(PyObject *self, PyObject *args, PyObject * keywds)
{
    double value;

    static char         *kwlist[] = {
                            "value",
                            NULL,
                        };

    if( !PyArg_ParseTupleAndKeywords(
            args, keywds, "d|", kwlist, &value
        ))
    {
        return NULL;
    }

    percents = value;
    printf("value is %f", percents);

    Py_XDECREF(args);
    Py_XDECREF(kwlist);

    return Py_None;
}


static PyObject *percents_get(PyObject *self, PyObject *args)
{
    PyObject *value = PyUnicode_FromFormat("%d", percents);

    printf("percents are %f", percents);
    Py_XDECREF(args);

    return value;
}

void percentage_update( double new_value )
{
    percents = new_value;
}

double percentage_get( void )
{
    return percents;
}



static PyObject *perform_da_action(PyObject *self, PyObject *args, PyObject * keywds)
{
    int             action;
    char            *file_path;
    unsigned long   start_addr      = 0;
    unsigned long   readwrite_len   = 0;
    int             no_erase        = 0;
    int				npages          = 30;
    int             spage           = 0;
    int             reset_flag      = 0;
    int             verify          = 0;
    int	            retry           = 10;
    int             exec_flag       = 0;
    unsigned long   execute_addr    = 0;

    PyObject *py_callback = Py_None;

    static char     *kwlist[] = {
                        "action",
                        "file_path",
                        "start_addr",
                        "readwrite_len",
                        "no_erase",
                        "npages",
                        "spage",
                        "reset_flag",
                        "verify",
                        "retry",
                        "execute_flag",
                        "execute_addr",
                        "callback",

                         NULL
                    };

    if( !PyArg_ParseTupleAndKeywords(
            args, keywds, "is|kkiiiiiiikO", kwlist,
            &action, &file_path, &start_addr, &readwrite_len, &no_erase,
            &npages, &spage, &reset_flag, &verify, &retry, &exec_flag,
            &execute_addr, &py_callback
        ))
    {
        return NULL;
    }
    printf("action: %s \n", action2str(action));

    int ret = 1;

	uint8_t		            buffer[256];
	long unsigned int	    addr;
	long unsigned int       start;
	long unsigned int       end;
	unsigned int            len;
	int		                failed = 0;
	int		                first_page, num_pages;

    /*
     * Cleanup addresses:
     *
     * Starting from options
     *      start_addr, readwrite_len, spage, npages
     * and using device memory size, compute
     *      start, end, first_page, num_pages
     */

    printf("Otletaem pered checkom \n");
    if (!PyCallable_Check(py_callback))
    {
        PyErr_SetString(PyExc_TypeError, "Need a callable object!");
    }
    else
    {
        printf("allrighty, we can call to a callback \n");    // Build up the argument list...
    }


    if( !stm )
    {
        printf("im sorry, but you will have to initialize stm struct in the first place \n");
		close_with_argument(self, 1, 0, 0);
		return Py_None;
    }
    else
    {
        if( !p_st )
        {
            printf("Initiate the parser on the first place \n");
            close_with_argument(self, ret, exec_flag, execute_addr);
            return Py_None;
        }
        else
        {
            if (start_addr || readwrite_len)
            {
                start = start_addr;

                if (is_addr_in_flash(start))
                {
                    end = stm->dev->fl_end;
                }
                else
                {
                    no_erase = 1;
                    if (is_addr_in_ram(start))
                    {
                        end = stm->dev->ram_end;
                    }
                    else
                    {
                        end = start + sizeof(uint32_t);
                    }
                }

                if (readwrite_len && (end > start + readwrite_len))
                {
                    end = start + readwrite_len;
                }

                first_page = flash_addr_to_page_floor(start);
                if (!first_page && end == stm->dev->fl_end)
                {
                    num_pages = STM32_MASS_ERASE;
                }
                else
                {
                    num_pages = flash_addr_to_page_ceil(end) - first_page;
                }
            }
            else
            if (!spage && !npages)
            {
                start = stm->dev->fl_start;
                end = stm->dev->fl_end;
                first_page = 0;
                num_pages = STM32_MASS_ERASE;
            }
            else
            {
                first_page = spage;
                start = flash_page_to_addr(first_page);

                if (start > stm->dev->fl_end)
                {
                    printf("Address range exceeds flash size.\n");
                    close_with_argument(self, ret, exec_flag, execute_addr);
                    return Py_None;
                }

                if (npages)
                {
                    num_pages = npages;
                    printf("Erasing wery special count of pages %d \n", npages);
                    end = flash_page_to_addr(first_page + num_pages);
                    if (end > stm->dev->fl_end)
                    {
                        end = stm->dev->fl_end;
                    }
                }
                else
                {
                    end = stm->dev->fl_end;
                    num_pages = flash_addr_to_page_ceil(end) - first_page;
                }

