StasOverflow/stm32_flash/app/back/c_imports/stm32flash/stm_py.c
                if (!first_page && end == stm->dev->fl_end)
                {
                    num_pages = STM32_MASS_ERASE;
                }
            }


            parser_err_t            perr = 0;
            stm32_err_t             s_err;


            if (action == ACT_READ)
            {
                unsigned int max_len = port_opts.rx_frame_max;

                printf("Memory read\n");

                perr = parser->open(p_st, file_path, 1);
                if (perr != PARSER_ERR_OK)
                {
                    printf("%s ERROR: %s\n", parser->name, parser_errstr(perr));
                    if (perr == PARSER_ERR_SYSTEM)
                    {
                        perror(file_path);
                    }
                    close_with_argument(self, ret, exec_flag, execute_addr);
                    return Py_None;
                    // Insert Close goto close;
                }

                addr = start;
                while(addr < end)
                {
                    uint32_t left = end - addr;
                    len		= max_len > left ? left : max_len;
                    s_err = stm32_read_memory(stm, addr, buffer, len);
                    if (s_err != STM32_ERR_OK)
                    {
                        printf("Failed to read memory at address 0x%08lx, target write-protected?\n", addr);

                        close_with_argument(self, ret, exec_flag, execute_addr);
                        return Py_None;
                        // Insert Close goto close;
                    }
                    if (parser->write(p_st, buffer, len) != PARSER_ERR_OK)
                    {
                        printf("Failed to write data to file\n");

                        close_with_argument(self, ret, exec_flag, execute_addr);
                        return Py_None;
                        // Insert Close goto close;
                    }
                    addr += len;

                    // TODO: Replace this output with smth
//                    printf("\rRead address 0x%08lx (%.2f%%) ",
//                        addr,
//                        (100.0f / (float)(end - start)) * (float)(addr - start)
//                    );
                    int cal = (100.0f / (float)(end - start)) * (float)(addr - start);
                    PyObject *arglist = Py_BuildValue("(i)", cal );

                    PyObject *result = PyEval_CallObject(py_callback, arglist);
                }

                printf("Done, now close all stuff\n");

                ret = 0;
                close_with_argument(self, ret, exec_flag, execute_addr);
                return Py_None;
                // Insert Close goto close;

                printf("Parser error: %s \n", parser_errstr(perr));
            }
            else
            if (action == ACT_READ_PROTECT)
            {
                printf("Read-Protecting flash\n");
                // the device automatically performs a reset after the sending the ACK
                reset_flag = 0;
                stm32_readprot_memory(stm);
                printf("Done.\n");
            }
            else
            if (action == ACT_READ_UNPROTECT)
            {
                printf("Read-UnProtecting flash\n");
                // the device automatically performs a reset after the sending the ACK
                reset_flag = 0;
                stm32_runprot_memory(stm);
                printf("Done.\n");
            }
            else
            if (action == ACT_ERASE_ONLY)
            {
                ret = 0;
                printf("Erasing flash\n");

                if (num_pages != STM32_MASS_ERASE &&
                    (start != flash_page_to_addr(first_page) || end != flash_page_to_addr(first_page + num_pages)))
                {
                    printf("Specified start & length are invalid (must be page aligned)\n");
                    ret = 1;
                    close_with_argument(self, ret, exec_flag, execute_addr);
                    return Py_None;
                }

                s_err = stm32_erase_memory(stm, first_page, num_pages);
                if (s_err != STM32_ERR_OK)
                {
                    printf("Failed to erase memory\n");
                    ret = 1;
                    close_with_argument(self, ret, exec_flag, execute_addr);
                    return Py_None;
                }
            }
            else
            if (action == ACT_WRITE_UNPROTECT)
            {
                printf("Write-unprotecting flash\n");
                // the device automatically performs a reset after the sending the ACK
                reset_flag = 0;
                stm32_wunprot_memory(stm);
                printf("Done.\n");

            }
            else
            if (action == ACT_WRITE)
            {
                printf("Write to memory\n");

                off_t 	offset = 0;
                ssize_t r;
                unsigned int size;
                unsigned int max_wlen, max_rlen;

                max_wlen = port_opts.tx_frame_max - 2;	// skip len and crc
                max_wlen &= ~3;	                        // 32 bit aligned

                max_rlen = port_opts.rx_frame_max;
                max_rlen = max_rlen < max_wlen ? max_rlen : max_wlen;

                ///Assume data from stdin is whole device
                if (file_path[0] == '-' && file_path[1] == '\0')
                {
                    size = end - start;
                }
                else
                {
                    size = parser->size(p_st);
                }

                // TODO: It is possible to write to non-page boundaries, by reading out flash
                //       from partial pages and combining with the input data
                // if ((start % stm->dev->fl_ps[i]) != 0 || (end % stm->dev->fl_ps[i]) != 0) {
                //	printf("Specified start & length are invalid (must be page aligned)\n");
                //	goto close;
                // }

                // TODO: If writes are not page aligned, we should probably read out existing flash
                //       contents first, so it can be preserved and combined with new data
                if (!no_erase && num_pages)
                {
                    printf("Erasing memory\n");
                    printf("Bifor s_err \n");
                    if( stm )
                    {
//                        s_err = stm32_erase_memory(stm, first_page, num_pages);
                    }
                    else
                    {
                        printf("Shit was about to happen, but we prevented it by printing this garbage text \n");
                        close_with_argument(self, ret, exec_flag, execute_addr);
                        return Py_None;
                    }

                    printf("after s_err \n");
                    if (s_err != STM32_ERR_OK)
                    {
                        printf("Failed to erase memory\n");
                        close_with_argument(self, ret, exec_flag, execute_addr);
                        return Py_None;
                    }
                }

//                fflush(diag);
                addr = start;
                while(addr < end && offset < size)
                {
                    uint32_t left	= end - addr;
                    len		= max_wlen > left ? left : max_wlen;
                    len		= len > size - offset ? size - offset : len;

