StasOverflow/stm32_flash/app/back/c_imports/stm32flash/stm_py.c
                    if (parser->read(p_st, buffer, &len) != PARSER_ERR_OK)
                    {
                        printf("parser ne ok \n");
                        close_with_argument(self, ret, exec_flag, execute_addr);
                        return Py_None;
                    }

                    if (len == 0)
                    {
                        if (file_path[0] == '-')
                        {
                            break;
                        }
                        else
                        {
                            printf("failed some filename shit \n");
                            close_with_argument(self, ret, exec_flag, execute_addr);
                            return Py_None;
                        }
                    }


                    while( failed < retry )
                    {
//                        printf("Here Here, %d/%d \n", failed, retry);
                        s_err = stm32_write_memory(stm, addr, buffer, len);
                        if (s_err != STM32_ERR_OK)
                        {
                            printf("Failed to write memory at address 0x%08lx\n", addr);
                            close_with_argument(self, ret, exec_flag, execute_addr);
                            return Py_None;
                        }
                        if (verify)
                        {
                            uint8_t compare[len];
                            unsigned int offset, rlen;

                            offset = 0;
                            while (offset < len)
                            {
                                rlen = len - offset;
                                rlen = rlen < max_rlen ? rlen : max_rlen;
                                s_err = stm32_read_memory(stm, addr + offset, compare + offset, rlen);
                                if (s_err != STM32_ERR_OK)
                                {
                                    printf("Failed to read memory at address 0x%08lx\n", addr + offset);
                                    close_with_argument(self, ret, exec_flag, execute_addr);
                                    return Py_None;
                                }
                                offset += rlen;
                            }

                            for(r = 0; r < len; ++r)
                            {
                                if (buffer[r] != compare[r])
                                {
                                    if (failed == retry)
                                    {
                                        printf("Failed to verify at address 0x%08x, expected 0x%02x and found 0x%02x\n",
                                            (uint32_t)(addr + r),
                                            buffer [r],
                                            compare[r]
                                        );
                                        close_with_argument(self, ret, exec_flag, execute_addr);
                                        return Py_None;
                                    }
                                    ++failed;
                                    break;
                                }

				                failed = 0;
                            }
                        }
//                        printf("Breaking bad \n");
//                        failed = 10;
                        break;
                    }
                    failed = 0;

                    addr	+= len;
                    offset	+= len;

//                    printf(
//                        "\rWrote %saddress 0x%08lx (%.2f%%) ",
//                        verify ? "and verified " : "",
//                        addr,
//                        (100.0f / size) * offset
//                    );

                    int cal = (100.0f / size) * offset;
                    PyObject *arglist = Py_BuildValue("(i)", cal );

                    PyObject *result = PyEval_CallObject(py_callback, arglist);
                }

                printf("Done.\n");
                ret = 0;
                printf("exec flag before entering close function is %d \n", exec_flag);
                close_with_argument(self, ret, exec_flag, execute_addr);
                return Py_None;
            }
            else
            if (action == ACT_CRC)
            {
                unsigned long int crc_val = 0;

                printf("CRC computation\n");

                s_err = stm32_crc_wrapper(stm, start, end - start, (uint32_t *)&crc_val);
                if (s_err != STM32_ERR_OK)
                {
                    printf("Failed to read CRC\n");
                    close_with_argument(self, ret, exec_flag, execute_addr);
                    return Py_None;
                }
                printf("CRC(0x%08lx-0x%08lx) = 0x%08lx\n", start, end, crc_val);

                ret = 0;
                close_with_argument(self, ret, exec_flag, execute_addr);
                return Py_None;
            }
            else
            {
                printf("No concrette action specified \n");
                ret = 0;
                close_with_argument(self, ret, exec_flag, execute_addr);
                return Py_None;
            }
        }
    }

    return Py_None;
}


static PyObject* closing_sequence(PyObject * self, PyObject * args, PyObject * keywds)
{
    int                     reset_flag          = 0;
    int                     exec_flag		    = 0;
    unsigned long int		execute_addr        = 0;
    int		                ret                 = 1;
    char                    *gpio_seq           = DEFAULT_GPIO_SEQ;

    static char *kwlist[] = {"reset_flag", "exec_flag", "execute_addr", "ret", "gpio_seq", NULL};

    if (!PyArg_ParseTupleAndKeywords(args, keywds, "|iikis", kwlist,
                    &reset_flag, &exec_flag, &execute_addr, &ret, &gpio_seq)
       )
    {
        return NULL;
    }

    if( !stm )
    {
        printf("to close something, you need to open something at first \n");
    }
    else
    {

        printf("Execu flago is %d \n", exec_flag);

        if( p_st )
        {
            if (stm && exec_flag && ret == 0)
            {
                if (execute_addr == 0)
                {
                    execute_addr = stm->dev->fl_start;
                }

                printf("\nStarting execution at address 0x%08lx... ", execute_addr);

