StasOverflow/stm32_flash/app/back/c_imports/stm32flash/stm_py.c
    //            fflush(diag);
                if (stm32_go(stm, execute_addr) == STM32_ERR_OK)
                {
                    reset_flag = 0;
                    printf("done.\n");
                }
                else
                {
                    printf("failed.\n");
                }
            }

            if (stm && reset_flag)
            {
                printf("\nResetting device... ");

    //            fflush(diag);
                if (init_bl_exit(stm, port, gpio_seq))
                {
                    printf("done.\n");
                }
                else
                {
                    printf("failed.\n");
                }
            }
        }
    }

	if( p_st )
	{
	    printf("Closing parser \n");
	    parser->close(p_st);
	    p_st = NULL;
	}

	if( stm )
	{
	    printf("Closing stm \n");
	    stm32_close(stm);
	    stm = NULL;
	}

	if (port)
	{
	    printf("Closing port \n");
		port->close(port);
		port = NULL;
	}

	Py_XDECREF(args);
	Py_XDECREF(kwlist);
//	Py_XDECREF(keywds);

    return Py_None;
//	fprintf(diag, "\n");
}


static PyObject* baud_list(PyObject * self, PyObject * args)
{
    PyObject *lst = PyList_New(SERIAL_BAUD_INSTANCES_COUNT);

    if (!lst)
    {
        return NULL;
    }
    for (int i = 0; i < SERIAL_BAUD_INSTANCES_COUNT; i++) {
        PyObject *val = PyUnicode_FromFormat("%lu", serial_get_baud_int(i));
        if (!val) {
            Py_DECREF(lst);
            return NULL;
        }
        PyList_SET_ITEM(lst, i, val);   // reference to num stolen
    }

    return lst;


//    Py_XDECREF(keywds);

}
// Our Python binding to our C function
/* here we had some pyc function */

static PyMethodDef stm32_flash_methods[] = {
//    { "action", action, METH_VARARGS, "performs da main action" },
    { "port_open", (PyCFunction) open_da_port, METH_VARARGS | METH_KEYWORDS, "opens a port"},
    { "port_close", close_da_port, METH_NOARGS, "closes a port"},
    { "parser_init", (PyCFunction) init_da_parser, METH_VARARGS | METH_KEYWORDS, "inits either binary or hex parser"},
    { "parser_open", (PyCFunction) open_with_parser, METH_VARARGS | METH_KEYWORDS, "opens a file on a given path"},
    { "parser_close", (PyCFunction) close_da_parser, METH_NOARGS, "closes a parser"},
    { "stm_init",   (PyCFunction) init_da_stm,
                    METH_VARARGS | METH_KEYWORDS,
                    "inits stm with optional init flag and gpio seq"
    },
    { "stm_close",  (PyCFunction) close_da_stm, METH_NOARGS, "close stm struct or whatever" },
    { "action_perform", (PyCFunction) perform_da_action,
                    METH_VARARGS | METH_KEYWORDS,
                    "takes lots and lots of arguments which are going to and will be described a bit later"
    },
    { "close_all", (PyCFunction) closing_sequence,
                    METH_VARARGS | METH_KEYWORDS,
                    "performs finalizing actions, closes stuff all around"
    },
    { "polled_func", (PyCFunction) polled_method,
                    METH_VARARGS | METH_KEYWORDS,
                    "sample method"
    },
    { "pull", (PyCFunction) pull_method,
                    METH_VARARGS | METH_KEYWORDS,
                    "sample method namba 2"
    },
    { "baud_list_get", baud_list, METH_NOARGS, "function, returning a list of available baud rates"},
    { "percents_get", percents_get, METH_NOARGS, "blah"},
    { "percents_set", (PyCFunction) percents_set, METH_KEYWORDS},

    { NULL, NULL, 0, NULL }
};


// Our Module Definition struct
static struct PyModuleDef stm32_flash_module = {
    PyModuleDef_HEAD_INIT,
    "Stm32FlashModule",
    "STM32 FLASH Module",
    -1,
    stm32_flash_methods
};


static PyObject* polled_method(PyObject * self, PyObject * args, PyObject * keywds)
{
    int arg1;
    char *arg2;
    unsigned long int arg3;

    static char *kwlist[] = {"arg1", "arg2", "arg3", NULL};

    if (!PyArg_ParseTupleAndKeywords(args, keywds, "isk|", kwlist, &arg1, &arg2, &arg3))
    {
        return NULL;
    }

    Py_XDECREF(kwlist);
    Py_XDECREF(args);
//    Py_XDECREF(keywds);

    return Py_None;
}



static PyObject* pull_method(PyObject * self, PyObject * args, PyObject * keywds)
{
    int arg1 = 2;
    char *arg2 = "Sample Text";
    unsigned long arg3 = 8541116;

    static char *kwlist[] = {"arg1", "arg2", "arg3", NULL};

    if (!PyArg_ParseTupleAndKeywords(args, keywds, "|isk", kwlist, &arg1, &arg2, &arg3))
    {
        return NULL;
    }

    PyObject *argsumentios =  Py_BuildValue("()");;  // Py_BuildValue("(isk)", arg1, arg2, arg3);
    PyObject *keywords = PyDict_New();

    PyObject* argumentio1 = Py_BuildValue("i", arg1);
    PyObject* argumentio2 = Py_BuildValue("s", arg2);
    PyObject* argumentio3 = Py_BuildValue("k", arg3);

    PyDict_SetItem(keywords, PyUnicode_FromString("arg1"), argumentio1);
    PyDict_SetItemString(keywords, "arg2", argumentio2);
    PyDict_SetItem(keywords, PyUnicode_FromString("arg3"), argumentio3);

    PyObject *myobject_method = PyObject_GetAttrString(self, "polled_func");

    PyObject *result = PyObject_Call(myobject_method, argsumentios, keywords);

    Py_XDECREF(kwlist);
    Py_XDECREF(args);
//    Py_XDECREF(keywds);

    Py_XDECREF(argumentio1);
    Py_XDECREF(argumentio2);
    Py_XDECREF(argumentio3);
    Py_XDECREF(argsumentios);
    Py_XDECREF(keywords);
    Py_XDECREF(myobject_method);
    Py_XDECREF(result);

    return Py_None;
}

static void close_with_argument( PyObject *self, int ret, int flag, unsigned long addr )
{
    PyObject *args = Py_BuildValue("()");
    PyObject *ret_val = Py_BuildValue("i", ret);
    PyObject *exec = Py_BuildValue("i", flag);
    PyObject *exec_addr = Py_BuildValue("k", addr);
    PyObject *keywords = PyDict_New();
//
    PyDict_SetItem(keywords, PyUnicode_FromString("ret"), ret_val);
    PyDict_SetItem(keywords, PyUnicode_FromString("exec_flag"), exec);
    PyDict_SetItem(keywords, PyUnicode_FromString("execute_addr"), exec_addr);
//
    PyObject *myobject_method = PyObject_GetAttrString(self, "close_all");

    PyObject *result = PyObject_Call(myobject_method, args, keywords);
//
    Py_XDECREF(args);
    Py_XDECREF(ret_val);
    Py_XDECREF(exec);
    Py_XDECREF(exec_addr);
    Py_XDECREF(keywords);
    Py_XDECREF(exec_addr);
    Py_XDECREF(myobject_method);
    Py_XDECREF(result);
}

// Initializes our module using our above struct
PyMODINIT_FUNC PyInit_stm32_flash(void)
{
    PyObject* m;

